#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_dns_record.subdomain["bazar"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "bazar.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["compartilhado"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "compartilhado.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["jellyfin"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "jellyfin.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["jellyseerr"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "jellyseerr.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["kuma"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "kuma.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["minio"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "minio.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["minio-data"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "minio-data.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["n8n"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "n8n.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["npm"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "npm.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["portainer"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "portainer.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["radar"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "radar.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["readar"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "readar.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["sabnzbd"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "sabnzbd.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["sonar"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "sonar.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["tandoor"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tandoor.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["test"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "test.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["transmission"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "transmission.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_dns_record.subdomain["wyl"] will be created
  + resource "cloudflare_dns_record" "subdomain" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "wyl.atoca.house"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = (sensitive value)
    }

  # cloudflare_r2_bucket.rpi_k8s will be created
  + resource "cloudflare_r2_bucket" "rpi_k8s" {
      + account_id    = "10703aaeb553ac067d0a5d6edef8a44b"
      + creation_date = (known after apply)
      + id            = (known after apply)
      + jurisdiction  = "default"
      + location      = "WEUR"
      + name          = "rpi-k8s-backup"
      + storage_class = "Standard"
    }

  # cloudflare_r2_bucket.rpi_k8s_crunchy_postgres will be created
  + resource "cloudflare_r2_bucket" "rpi_k8s_crunchy_postgres" {
      + account_id    = "10703aaeb553ac067d0a5d6edef8a44b"
      + creation_date = (known after apply)
      + id            = (known after apply)
      + jurisdiction  = "default"
      + location      = "WEUR"
      + name          = "rpi-k8s-crunchy-postgres"
      + storage_class = "Standard"
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @guilhermewolf, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Plan`*